
[
{"author": "c w.", "content": "Simple and authentic menu with super fresh perfectly seasoned fish! Wouldn't mind a few more options for vegetation and sides, but ultimately love the simplicity.", "rating": "4 star rating", "date": "2/4/2023"},
{"author": "R T.", "content": "Great sushi! But what are they hiding upstairs I've never been up there because I don't have enough clout to get up there. I'm just a sucker at the sushi bar blowing my entire paycheck on raw fish because I have a compulsive personality disorder that is untreated with medication! So I buy like 3 rolls and 5 beers and 10 different nigiri by myself like a got dam psychopath!", "rating": "5 star rating", "date": "2/4/2023"},
{"author": "Marc W.", "content": "I know this place has been around for 40 years, but g-d only knows why because the food tastes like it's that old as well. Also: it's 2023 and they only take cash. Service 8/10 Food 2/10 Ambience 5/10", "rating": "1 star rating", "date": "1/27/2023"},
{"author": "Jessica P.", "content": "My nephews are sushi aficionados and gave hide 9.7/10! Definitely impressed them, also great service! Cash only so make sure you bring cash.", "rating": "5 star rating", "date": "1/25/2023"},
{"author": "Monica M.", "content": "By far our favorite place for sushi on Sawtelle never had a bad meal here. Sushi is always fresh and delicious. It gets a little crowded because many people are waiting to eat.  the dining room is a touch small but I promise you it's worth the wait. The service is great. Sushi is delicious. We love Hide sushi.", "rating": "5 star rating", "date": "1/20/2023"},
{"author": "Natalie G.", "content": "Love Sushi Hide!! Used to go many many years ago and rediscovered it last year. The food feels very fresh and is always so tasty. Love the teriyaki dinner combination. A relaxing & quiet type of place for dinner on Sawtelle.", "rating": "5 star rating", "date": "12/31/2022"},
{"author": "Matthew M.", "content": "My favorite Sushi Restaraunt in Los Angeles. You can always count on having great service and amazing and authentic sushi. Their spicy tuna and yellowtail cut rolls are a favorite. Hide's nigiri/sashimi is always fresh and delicious. If you're feeling adventurous try the Ankimo (monkfish liver) or the Amaebi (cooked tempura shrimp heads and raw shrimp served over rice). Not for everyone but if you like sushi and trying new things, this is the place to do it.  Cash only but they have an ATM inside. Don't mind the negative reviews, I've eaten at this sushi restaurant more times than I can count and am pretty picky when it comes to sushi. They've never disappointed. Some people decide they want to have a bad experience, so sure enough they'll have one.", "rating": "5 star rating", "date": "12/10/2022"},
{"author": "Prada P.", "content": "Made some changes to their restaurant.  Renovated and looks much nicer and staff seem much more friendly", "rating": "5 star rating", "date": "11/30/2022"},
{"author": "Henry J.", "content": "Food quantity is not good and too long waiting time. It doesn't worthy to visit:(:(:(", "rating": "1 star rating", "date": "11/27/2022"},
{"author": "Nancy B.", "content": "Always superb! Freshest fish, best tempura, and every thing else. Employees are very efficient. Our go to sushi favorite!", "rating": "5 star rating", "date": "11/25/2022"}
][
{"author": "c w.", "content": "Simple and authentic menu with super fresh perfectly seasoned fish! Wouldn't mind a few more options for vegetation and sides, but ultimately love the simplicity.", "rating": "4 star rating", "date": "2/4/2023"},
{"author": "R T.", "content": "Great sushi! But what are they hiding upstairs I've never been up there because I don't have enough clout to get up there. I'm just a sucker at the sushi bar blowing my entire paycheck on raw fish because I have a compulsive personality disorder that is untreated with medication! So I buy like 3 rolls and 5 beers and 10 different nigiri by myself like a got dam psychopath!", "rating": "5 star rating", "date": "2/4/2023"},
{"author": "Marc W.", "content": "I know this place has been around for 40 years, but g-d only knows why because the food tastes like it's that old as well. Also: it's 2023 and they only take cash. Service 8/10 Food 2/10 Ambience 5/10", "rating": "1 star rating", "date": "1/27/2023"},
{"author": "Jessica P.", "content": "My nephews are sushi aficionados and gave hide 9.7/10! Definitely impressed them, also great service! Cash only so make sure you bring cash.", "rating": "5 star rating", "date": "1/25/2023"},
{"author": "Monica M.", "content": "By far our favorite place for sushi on Sawtelle never had a bad meal here. Sushi is always fresh and delicious. It gets a little crowded because many people are waiting to eat.  the dining room is a touch small but I promise you it's worth the wait. The service is great. Sushi is delicious. We love Hide sushi.", "rating": "5 star rating", "date": "1/20/2023"},
{"author": "Natalie G.", "content": "Love Sushi Hide!! Used to go many many years ago and rediscovered it last year. The food feels very fresh and is always so tasty. Love the teriyaki dinner combination. A relaxing & quiet type of place for dinner on Sawtelle.", "rating": "5 star rating", "date": "12/31/2022"},
{"author": "Matthew M.", "content": "My favorite Sushi Restaraunt in Los Angeles. You can always count on having great service and amazing and authentic sushi. Their spicy tuna and yellowtail cut rolls are a favorite. Hide's nigiri/sashimi is always fresh and delicious. If you're feeling adventurous try the Ankimo (monkfish liver) or the Amaebi (cooked tempura shrimp heads and raw shrimp served over rice). Not for everyone but if you like sushi and trying new things, this is the place to do it.  Cash only but they have an ATM inside. Don't mind the negative reviews, I've eaten at this sushi restaurant more times than I can count and am pretty picky when it comes to sushi. They've never disappointed. Some people decide they want to have a bad experience, so sure enough they'll have one.", "rating": "5 star rating", "date": "12/10/2022"},
{"author": "Prada P.", "content": "Made some changes to their restaurant.  Renovated and looks much nicer and staff seem much more friendly", "rating": "5 star rating", "date": "11/30/2022"},
{"author": "Henry J.", "content": "Food quantity is not good and too long waiting time. It doesn't worthy to visit:(:(:(", "rating": "1 star rating", "date": "11/27/2022"},
{"author": "Nancy B.", "content": "Always superb! Freshest fish, best tempura, and every thing else. Employees are very efficient. Our go to sushi favorite!", "rating": "5 star rating", "date": "11/25/2022"}
][
{"author": "Rebecca C.", "content": "I've passed by Hide Sushi many times and it always seems like there's a bit of a wait (just like every other place in Sawtelle!) to get a spot, but today it seemed like the wait was shorter than usual so we decided to give it a try. While we were waiting, we noticed that there's a sign on the door that notes that it's a cash-only establishment, but they do have an ATM inside. Tthe charge was maybe $1.60 to use it; my boyfriend got cash out and noted that it was cheaper than he expected. The person who was running the wait list was really friendly and the interior is super cute. I got the dinner combination with the beef teriyaki and the salmon sashimi, both of which were decent but nothing too impressive. It came with rice and sunomono with sesame seed. I think the cabbage-looking thing is tsukemono because it's listed on the website, but the menu on the website is slightly different than the PDF/QR code menu that opens up, which doesn't list this. I'm not sure if they were supposed to include the cabbage-looking thing to be honest because they also randomly brought me a miso soup which I didn't order--it wasn't a problem because I was thinking about ordering it, and a happy surprise. They did forget my rice for the dinner combination though (which they brought after I asked), so I think the service could use some improvement. I don't have any allergies or anything like that so it's not a problem if I'm brought someone else's order/an extra dish or something, but be careful if you do. My boyfriend got the spicy tuna, shrimp, salmon/avocado, yellowtail & scallion, and the scallops special roll. The shrimp was probably the least impressive of these and I think we would skip this the next time, but the last two were great. The cut roll pieces here seem like they have a little bit more height/are a little bigger than what I'm used to from other places, so even though they have just 4 pieces I thought it was a reasonable serving size. I think the best part though was the sushi (it's in the name after all!). Next time if I were to come, I would skip the dinner combinations in favor of the rolls.", "rating": "4 star rating", "date": "10/30/2022"},
{"author": "Vië D.", "content": "In the meantime there were long lines everywhere, we decided to come in Hide because there's was no line here, we waited 7 mins to get set up. The service was mehh! Cash only, as they put the sign outdoor.FOODS : I am a picky eater, so mind me if you are the same. Everything has no flavor but salt, I have never tried any miso soup this bad. The food was not super salty, but it felt like they didn't put anything else but salt in their food. Even the side dish screams salt only lol. The salmon sashimi was not good. I wished I didn't order the salmon sashimi plate on top of my salmon sashimi combo. We ordered the beef teriyaki, it seems like the beef was not marinated, all they did was cooking it and put the teriyaki sauce on top, that's it, that's why inside of the beef, it was so bland. The only thing I would give 4 stars was the geoduck & scallops & mushroom dynamite. I had tried one that was much much better, so they don't earn 5 stars from me for this. I will not come back :)", "rating": "1 star rating", "date": "11/19/2022"},
{"author": "Jennifer T.", "content": "Highly recommend sitting at the sushi bar with your date! You'll get to order sushi a la carte super easily, and even if you get a combo meal, you can still enjoy the proximity to a row of elderly sushi chefs tending carefully to their work :)Really enjoyed the beef teriyaki and sashimi combo meal, plus the scallops and tuna sushi off the a la carte menu. Reasonable prices and great location in Sawtelle. Very friendly staff :-) We will plan to come back sometime soon!", "rating": "5 star rating", "date": "10/17/2022"},
{"author": "Albert L.", "content": "Hide Sushi is a mainstay to the cultural fabric of Sawtelle Japantown, and really does provide some old school charm that some of the newer and hipper restaurants just don't have. I also really liked the service here - really attentive and quick. But I had a really inconsistent experience with my Nigiri plate of sushi, which is basically a Chirashi bowl without the rice (more on that later). The dollop of wasabi was applied unevenly in each piece of sushi and in some cases there was so much it became mouth numbing even after I scraped some off. I also thought the fish and sushi could taste quite dry - even in my wife's Chirashi bowl - but I think at the prices Hide was charging for their portions, that wasn't too surprising. I think if you really want sushi in Sawtelle without breaking the bank and you just want that old school vibe, then Hide is your place. But with so many options on Sawtelle, it would be hard to justify making this place a priority.", "rating": "3 star rating", "date": "9/14/2022"},
{"author": "Isabel C.", "content": "When it comes to sushi, I am always down to try what anyone has to offer. That is why one day when I was in Sawtelle, I decided to do just that and try Hide Sushi. From the moment I walked in, I knew this was going to be a special experience. To begin, I do want to make it clear that this is not an AYCE sushi restaurant and is cash only. And like many other non-AYCE sushi restaurants, I could immediately tell the difference in quality once we started eating. The menu is mainly divided into nigiri/sushi options, followed by \"hot food\" options. In terms of nigiri/sushi, we ordered Salmon, Tuna, Toro, and the California Roll. We also ordered a Teriyaki Beef and Tempura combination to share. I love Salmon in general, but this was on another level. The size of the fish, taste, and texture made me consider ordering 5 more. I would say the exact same thing for the Toro and Tuna, but admittedly I am biased towards Salmon. And while I was expecting \"good\" regarding the California Roll, I was genuinely surprised by how tasty it actually was. The Teriyaki Beef and Tempura combo was also good, but the nigiri/sushi are the must-trys in this case. Throughout the experience, staff was very attentive and friendly. In terms of parking, there is valet parking available as an option immediately on the left of the restaurant (via a driveway). Hide Sushi will validate your parking as well, which makes valet parking free. Otherwise, there are quite a few street parking spaces all over Sawtelle, although it does get hard to find available spots during peak hours (Sawtelle is generally fairly crowded).", "rating": "4 star rating", "date": "9/17/2022"},
{"author": "c w.", "content": "Simple and authentic menu with super fresh perfectly seasoned fish! Wouldn't mind a few more options for vegetation and sides, but ultimately love the simplicity.", "rating": "4 star rating", "date": "2/4/2023"},
{"author": "Lucia L.", "content": "I tried this place as an undergraduate, and almost four years later, Hide is still a disappointing experience for me, especially with so many other affordable sushi joints in Sawtelle. $18 for 8 pieces of nigiri is quite a steal that a broke graduate student like me appreciates, but I was unimpressed with the quality of the nigiri. One of the pieces of sashimi was super fishy, which led to an unpleasant remainder of the meal. The cooked pieces of squid and clam were also cut way too large, making it super hard to chew and swallow. We also ordered the scallop dynamite as an appetizer while waiting for the sushi, and I was quite disappointed to see that it consisted of 80% of mushroom (?!) and 20% of scallops.", "rating": "3 star rating", "date": "9/18/2022"},
{"author": "Troy E.", "content": "This is probably one of the best affordable sushi restaurants I've been to in LA, and I will be back. The food was great, the ambiance was very relaxed and the tables were spaced out enough where it didn't feel like we weren't overhearing other people's conversations (something that can be all too common here).My friend and I got the lunch special and ordered some sushi a la carte. For about $40 plus tip, I got miso soup salad and rice, an assortment of tempura and teriyaki chicken, and toro, uni, and hamachi sushi. The fish was pretty good quality, but I wasn't the biggest fan of how they made the sushi rice.The uni came from Santa Barbara too. I would have ordered more, but I was so full! Make sure you bring cash as this is a cash only restaurant.", "rating": "5 star rating", "date": "9/4/2022"},
{"author": "Sandee T.", "content": "Hide Sushi (pronounced \"hee-deh\") had been on my list for several years...* GET - Dinner combos (beef, teriyaki, tempura, chicken, take your pick) comes with miso soup, salad, bowl of rice = not bad** GET - Chirashi = ooooh that fresh sashimi and that sweet sushi rice.  Cleaned that sucka off.* GET - Nigiri = it's both pretty to look at and pretty to eat* GET - Yellowtail sushi = YUM!  * GET - Unagi sushi = warm and sweet and delish* YES - Large dining room with booth and table seating; bar seating available* YES - Simple wooden chairs and tables décor, beautiful lit-paneled ceiling* YES - Friendly, sometimes funny sushi chefs* HMM - Sometimes a long wait, depends on when you go.  Put your name on the whiteboard.* FYI - No reservations * FYI - Cash only restaurant, but they have ATM inside* FYI - Street metered parking or try free residential street parking one block EastFOUR STARS ****Recommend~", "rating": "4 star rating", "date": "8/16/2022"},
{"author": "Jana P.", "content": "This is definitely a gem! The fish here is really fresh and each nigiri piece is pretty hefty. We ordered a bunch of nigiri, from salmon to uni and everything was delicious. The price for everything was also relatively reasonable, especially for the quality of fish you're getting. Only downside is that this place is cash only, however, they do have an ATM in the restaurant if you do not have any $$ on you. I'll definitely be coming back here when I need to satisfy my sushi cravings.Parking available on the streets, or park in the nearby Marshall's lot.", "rating": "5 star rating", "date": "8/20/2022"}
]