[
{"author": "Marc W.", "content": "I know this place has been around for 40 years, but g-d only knows why because the food tastes like it's that old as well. Also: it's 2023 and they only take cash. ", "rating": "1 star rating"},
{"author": "Jessica P.", "content": "Service 8/10 Food 2/10 Ambience 5/10", "rating": "5 star rating"},
{"author": "Monica M.", "content": "My nephews are sushi aficionados and gave hide 9.7/10! Definitely impressed them, also great service! Cash only so make sure you bring cash.", "rating": "5 star rating"},
{"author": "Natalie G.", "content": "By far our favorite place for sushi on Sawtelle never had a bad meal here. Sushi is always fresh and delicious. It gets a little crowded because many people are waiting to eat.  the dining room is a touch small but I promise you it's worth the wait. The service is great. Sushi is delicious. We love Hide sushi.", "rating": "5 star rating"},
{"author": "Matthew M.", "content": "Love Sushi Hide!! Used to go many many years ago and rediscovered it last year. The food feels very fresh and is always so tasty. Love the teriyaki dinner combination. A relaxing & quiet type of place for dinner on Sawtelle.", "rating": "5 star rating"},
{"author": "Prada P.", "content": "My favorite Sushi Restaraunt in Los Angeles. You can always count on having great service and amazing and authentic sushi. Their spicy tuna and yellowtail cut rolls are a favorite. Hide's nigiri/sashimi is always fresh and delicious. If you're feeling adventurous try the Ankimo (monkfish liver) or the Amaebi (cooked tempura shrimp heads and raw shrimp served over rice). Not for everyone but if you like sushi and trying new things, this is the place to do it.  Cash only but they have an ATM inside. ", "rating": "5 star rating"},
{"author": "Henry J.", "content": "Don't mind the negative reviews, I've eaten at this sushi restaurant more times than I can count and am pretty picky when it comes to sushi. They've never disappointed. Some people decide they want to have a bad experience, so sure enough they'll have one.", "rating": "1 star rating"},
{"author": "Nancy B.", "content": "Made some changes to their restaurant.  Renovated and looks much nicer and staff seem much more friendly", "rating": "5 star rating"},
{"author": "Vië D.", "content": "Food quantity is not good and too long waiting time. It doesn't worthy to visit:(:(:(", "rating": "1 star rating"},
{"author": "Rebecca C.", "content": "Always superb! Freshest fish, best tempura, and every thing else. Employees are very efficient. Our go to sushi favorite!", "rating": "4 star rating"}
][
{"author": "Marc W.", "content": "I know this place has been around for 40 years, but g-d only knows why because the food tastes like it's that old as well. Also: it's 2023 and they only take cash. Service 8/10 Food 2/10 Ambience 5/10", "rating": "1 star rating"},
{"author": "Jessica P.", "content": "My nephews are sushi aficionados and gave hide 9.7/10! Definitely impressed them, also great service! Cash only so make sure you bring cash.", "rating": "5 star rating"},
{"author": "Monica M.", "content": "By far our favorite place for sushi on Sawtelle never had a bad meal here. Sushi is always fresh and delicious. It gets a little crowded because many people are waiting to eat.  the dining room is a touch small but I promise you it's worth the wait. The service is great. Sushi is delicious. We love Hide sushi.", "rating": "5 star rating"},
{"author": "Natalie G.", "content": "Love Sushi Hide!! Used to go many many years ago and rediscovered it last year. The food feels very fresh and is always so tasty. Love the teriyaki dinner combination. A relaxing & quiet type of place for dinner on Sawtelle.", "rating": "5 star rating"},
{"author": "Matthew M.", "content": "My favorite Sushi Restaraunt in Los Angeles. You can always count on having great service and amazing and authentic sushi. Their spicy tuna and yellowtail cut rolls are a favorite. Hide's nigiri/sashimi is always fresh and delicious. If you're feeling adventurous try the Ankimo (monkfish liver) or the Amaebi (cooked tempura shrimp heads and raw shrimp served over rice). Not for everyone but if you like sushi and trying new things, this is the place to do it.  Cash only but they have an ATM inside. Don't mind the negative reviews, I've eaten at this sushi restaurant more times than I can count and am pretty picky when it comes to sushi. They've never disappointed. Some people decide they want to have a bad experience, so sure enough they'll have one.", "rating": "5 star rating"},
{"author": "Prada P.", "content": "Made some changes to their restaurant.  Renovated and looks much nicer and staff seem much more friendly", "rating": "5 star rating"},
{"author": "Henry J.", "content": "Food quantity is not good and too long waiting time. It doesn't worthy to visit:(:(:(", "rating": "1 star rating"},
{"author": "Nancy B.", "content": "Always superb! Freshest fish, best tempura, and every thing else. Employees are very efficient. Our go to sushi favorite!", "rating": "5 star rating"},
{"author": "Vië D.", "content": "In the meantime there were long lines everywhere, we decided to come in Hide because there's was no line here, we waited 7 mins to get set up. The service was mehh! Cash only, as they put the sign outdoor.FOODS : I am a picky eater, so mind me if you are the same. Everything has no flavor but salt, I have never tried any miso soup this bad. The food was not super salty, but it felt like they didn't put anything else but salt in their food. Even the side dish screams salt only lol. The salmon sashimi was not good. I wished I didn't order the salmon sashimi plate on top of my salmon sashimi combo. We ordered the beef teriyaki, it seems like the beef was not marinated, all they did was cooking it and put the teriyaki sauce on top, that's it, that's why inside of the beef, it was so bland. The only thing I would give 4 stars was the geoduck & scallops & mushroom dynamite. I had tried one that was much much better, so they don't earn 5 stars from me for this. I will not come back :)", "rating": "1 star rating"},
{"author": "Rebecca C.", "content": "I've passed by Hide Sushi many times and it always seems like there's a bit of a wait (just like every other place in Sawtelle!) to get a spot, but today it seemed like the wait was shorter than usual so we decided to give it a try. While we were waiting, we noticed that there's a sign on the door that notes that it's a cash-only establishment, but they do have an ATM inside. Tthe charge was maybe $1.60 to use it; my boyfriend got cash out and noted that it was cheaper than he expected. The person who was running the wait list was really friendly and the interior is super cute. I got the dinner combination with the beef teriyaki and the salmon sashimi, both of which were decent but nothing too impressive. It came with rice and sunomono with sesame seed. I think the cabbage-looking thing is tsukemono because it's listed on the website, but the menu on the website is slightly different than the PDF/QR code menu that opens up, which doesn't list this. I'm not sure if they were supposed to include the cabbage-looking thing to be honest because they also randomly brought me a miso soup which I didn't order--it wasn't a problem because I was thinking about ordering it, and a happy surprise. They did forget my rice for the dinner combination though (which they brought after I asked), so I think the service could use some improvement. I don't have any allergies or anything like that so it's not a problem if I'm brought someone else's order/an extra dish or something, but be careful if you do. My boyfriend got the spicy tuna, shrimp, salmon/avocado, yellowtail & scallion, and the scallops special roll. The shrimp was probably the least impressive of these and I think we would skip this the next time, but the last two were great. The cut roll pieces here seem like they have a little bit more height/are a little bigger than what I'm used to from other places, so even though they have just 4 pieces I thought it was a reasonable serving size. I think the best part though was the sushi (it's in the name after all!). Next time if I were to come, I would skip the dinner combinations in favor of the rolls.", "rating": "4 star rating"}
][
{"author": "Prat S.", "content": "Discovered this new gem on tik tok, of course - will definitely be back!It utilizes the \"set\" concept for meals, with the option to order from 6 predefined sets on the menu (including an appetizer, snack, entree and dessert). The service was excellent - the staff was able to make 4 of the 6 sets vegetarian for me, and patiently explained all the substitutions for me. I love this concept because I feel like I often want to try multiple things on the menu when eating out, and the portion sizes here were perfect for me personally. A couple of the dishes were quite unique too, and every single one was delicious - tangy Thai coconut soup, *spicy* basil tofu bell pepper stir fry, and this incredibly delectable mango coconut pudding with jelly - SO good.And all for $20!! A steal in SF :) The ambiance was also very pleasant/lot of aesthetic spa-like decor. I can see this becoming extremely popular over the next couple months, especially for work lunches/dinners given the location. I also seen them rotating the menu based on seasonal produce, etc. and expanding to more drinks as well. Can't wait to visit again!", "rating": "5 star rating", "date": "2/14/2023"},
{"author": "Megan L.", "content": "New Thai restaurant tucked into an alleyway with a set-menu concept! Very welcoming service and casual ambiance. I love the idea of little bites and big flavor variety!!For February, they had 4 set options (beef, fish, duck, and vegetarian). I got the Set 01: Beef ($23.95) with the mango pudding option. This set came with sautéed beef w bell peppers, coconut soup w mushrooms, egg and spinach, papaya salad, a trio of jasmine, brown, and black rice and mango pudding. - Sautéed beef w bell peppers: extremely tender beef, perfectly cooked yet crunchy bell peppers with a slight kick (9/10)- Coconut soup w mushrooms: warm coconuty soup paired so well with the rice (8.5/10)- Egg and spinach: although simple, surpassingly stir fried well and had a five-spice flavor (9/10)- Papaya salad: bit more savory than fish-sauce/vinegary than I'm used to (7.5/10)- Trio of jasmine, brown, and black rice: I like jasmine and brown the most! - Mango pudding: since everything is served at once, by the time we got to dessert, it felt melted. More liquify than like pudding but a strong mango flavor (7.8/10)Overall, a bit pricy for one meal, but I think it's worth being able to have such a variety of flavors at once!", "rating": "4 star rating", "date": "2/11/2023"},
{"author": "Chloe S.", "content": "Delicious and spicy food served in a beautiful manner. Come here if you're looking to sample a good amount of dishes. However be warned that the food may take a while as our party of 4 waited roughly 20-25 minutes for our food. This would be the perfect place to catch up with friends and eat a delicious meal! Each set comes with 5-6 dishes. I got the fish set which came with fried catfish in a red curry which was light and crispy. The vegetable stir fire packed a BIG spice punch but paired perfect with a bite of rice. There was also vermicelli which was a nice break from the rice. The papaya salad seemed like it could be more spicy but still pretty solid. And you could chose from a mango pudding or lychee dessert. Overall everything was pretty tasty but just keep in mind the wait time. The staff are super nice and even came over to explain each dish to us. I believe the menu also changes each month so you can always come back to sample different dishes.", "rating": "4 star rating", "date": "2/10/2023"},
{"author": "Victoria E.", "content": "Great set menu. Came here after work with a friend. There are four sets. Beef, chicken, fish and vegetarian. She got the beef and I got the fish, the set menu came with salad, light starter, a vegetable side dish, the protein, the three rice combo, and dessert. Quite nice size food. Not at all overwhelming to sample everything without overeating. I don't find restaurants like this often and they really should have more like this around town.I also think people who come here are no fuss people. Very efficient. Great flavor. Food is solid. Would love to return.", "rating": "4 star rating", "date": "2/10/2023"},
{"author": "Darien G.", "content": "Hed verythai has been on my list of restaurants to try. It's a little off the beaten path past sushiritto in an alley. Upon walking into the restaurant, I first noticed the decor of the restaurant and it felt very homely. I decided to order the beef set menu. The beef just had enough spice and flavor.  The star of the meal for me was the tom kha kai. Granted I haven't had a lot of tom kha kai, but I would personally just go back for this soup. The meal came to be a little over $20 and I was full and satisfied.The service was great as well. The waiter was very nice and attentive.  I'm not sure if the manager or owner came by but they asked how was the food, what did you think about it and asked if there were any improvements to be made. Not many restaurants really ask about what improvements can be made and I think more restaurants should ask their customers.", "rating": "5 star rating", "date": "2/10/2023"},
{"author": "Alyssa L.", "content": "A cute place with great food and a fun concept! I ordered the duck set based on my love for duck curry, and was blown away by how delicious the butternut squash and egg dish was. The brussel sprout dish it came with was nice and spicy and acidic. The papaya salad was a little lacking in flavor, but everything else was great. Presentation is cute and it came out fast. The dishes look on the small side, but it's definitely a filling meal; I even took home leftovers. The servers were super friendly and helpful! Good value for such variety. Definitely recommend this spot!", "rating": "5 star rating", "date": "2/9/2023"},
{"author": "Areeta W.", "content": "Super cute & new Thai place in SF! They've been open for 3ish weeks and still in their soft opening phase! My group of 4 came in on a Tuesday night and got seated right away. I love how the menu has sets of things to try out so you can get a bit of everything! We ordered the vegetarian set, duck set, beef set, and fish set. Everything was yummy and they were very accommodating to my friend who has a fish & nut allergy. Overall, solid Thai place but service was just a bit slow even though we were 1 of 3 parties who were there and they messed up our orders (understanding considering they just opened!).", "rating": "4 star rating", "date": "2/7/2023"},
{"author": "Amy Z.", "content": "This is a brand new Thai restaurant with a selection of set menus for a really affordable price. I was so excited to try it after seeing some great reviews on Yelp! It was a little hard to find, it's down the end of a small alley in FiDi. The interior is clean and simple, with some minimal decor. The main issue of my experience was that we had to wait around 45min for our food to come out, despite the restaurant being about half full. Once the food did come out, I thought the portions were generous and the quality and variety were good. Hopefully the restaurant is able to gain their rhythm after a couple of weeks!", "rating": "4 star rating", "date": "2/5/2023"},
{"author": "Amber M.", "content": "Came across this spot on a random tiktok and it did not disappoint! The staff was incredibly friendly & they were able to customize 3 out of the 6 sets to be vegetarian. I got set 2 (kebabs were sold out so I got papaya salad) and the ingredients were incredibly fresh. The fried catfish was tender and everything was flavorful. For only 19.95 (before tax), it is definitely worth a stop. Will be back!", "rating": "5 star rating", "date": "2/4/2023"},
{"author": "Derek S.", "content": "Came by for lunch the other day and it was a disappointing experience. In fact, it felt like I was duped... Checked the photos on Instagram, Google, and Yelp with a modern interior and was surprised to see that the photos were all digitally enhanced... Actual photos of the interior of the restaurant have been posted...The restaurant was located in the corner of a back alley off of Kearny with no signage outside despite some lettering on the windows along with a sign on Kearny. Google, Yelp, and their website states that the restaurant opens at 11 am while the writing on the restaurant window states that the restaurant opens at 11:30 am...Reviewed the menu on the website and was impressed with the set menus that included dessert, Thai snacks including the money bag and got super excited!Upon arrival, the menu had been updated where a fruit dessert is an extra $4. In addition, there are no longer any money bags as part of the set menus. Instead, there was a mini papaya salad...bummer.The Pad See Ew from the pictures looked fantastic just like the ones I had in Thailand. My pad see ew came out super oily and salty...bummer.The chicken satay came out room temperature, with the chicken on the drier side and no charcoal marks...bummer.The chicken soup was served below room temperature and was extremely bland...this needed to be heated up as well as seasoned...The restroom reminded me of Thailand, a good 10F warmer than the restaurant, super humid, as well as very slippery floors...~$25/head after tax and gratuity for lunch. No SF mandates.", "rating": "2 star rating", "date": "2/4/2023"}
]