[
{"author": "Marc W.", "content": "I know this place has been around for 40 years, but g-d only knows why because the food tastes like it's that old as well. Also: it's 2023 and they only take cash. ", "rating": "1 star rating"},
{"author": "Jessica P.", "content": "Service 8/10 Food 2/10 Ambience 5/10", "rating": "5 star rating"},
{"author": "Monica M.", "content": "My nephews are sushi aficionados and gave hide 9.7/10! Definitely impressed them, also great service! Cash only so make sure you bring cash.", "rating": "5 star rating"},
{"author": "Natalie G.", "content": "By far our favorite place for sushi on Sawtelle never had a bad meal here. Sushi is always fresh and delicious. It gets a little crowded because many people are waiting to eat.  the dining room is a touch small but I promise you it's worth the wait. The service is great. Sushi is delicious. We love Hide sushi.", "rating": "5 star rating"},
{"author": "Matthew M.", "content": "Love Sushi Hide!! Used to go many many years ago and rediscovered it last year. The food feels very fresh and is always so tasty. Love the teriyaki dinner combination. A relaxing & quiet type of place for dinner on Sawtelle.", "rating": "5 star rating"},
{"author": "Prada P.", "content": "My favorite Sushi Restaraunt in Los Angeles. You can always count on having great service and amazing and authentic sushi. Their spicy tuna and yellowtail cut rolls are a favorite. Hide's nigiri/sashimi is always fresh and delicious. If you're feeling adventurous try the Ankimo (monkfish liver) or the Amaebi (cooked tempura shrimp heads and raw shrimp served over rice). Not for everyone but if you like sushi and trying new things, this is the place to do it.  Cash only but they have an ATM inside. ", "rating": "5 star rating"},
{"author": "Henry J.", "content": "Don't mind the negative reviews, I've eaten at this sushi restaurant more times than I can count and am pretty picky when it comes to sushi. They've never disappointed. Some people decide they want to have a bad experience, so sure enough they'll have one.", "rating": "1 star rating"},
{"author": "Nancy B.", "content": "Made some changes to their restaurant.  Renovated and looks much nicer and staff seem much more friendly", "rating": "5 star rating"},
{"author": "Vië D.", "content": "Food quantity is not good and too long waiting time. It doesn't worthy to visit:(:(:(", "rating": "1 star rating"},
{"author": "Rebecca C.", "content": "Always superb! Freshest fish, best tempura, and every thing else. Employees are very efficient. Our go to sushi favorite!", "rating": "4 star rating"}
][
{"author": "Marc W.", "content": "I know this place has been around for 40 years, but g-d only knows why because the food tastes like it's that old as well. Also: it's 2023 and they only take cash. Service 8/10 Food 2/10 Ambience 5/10", "rating": "1 star rating"},
{"author": "Jessica P.", "content": "My nephews are sushi aficionados and gave hide 9.7/10! Definitely impressed them, also great service! Cash only so make sure you bring cash.", "rating": "5 star rating"},
{"author": "Monica M.", "content": "By far our favorite place for sushi on Sawtelle never had a bad meal here. Sushi is always fresh and delicious. It gets a little crowded because many people are waiting to eat.  the dining room is a touch small but I promise you it's worth the wait. The service is great. Sushi is delicious. We love Hide sushi.", "rating": "5 star rating"},
{"author": "Natalie G.", "content": "Love Sushi Hide!! Used to go many many years ago and rediscovered it last year. The food feels very fresh and is always so tasty. Love the teriyaki dinner combination. A relaxing & quiet type of place for dinner on Sawtelle.", "rating": "5 star rating"},
{"author": "Matthew M.", "content": "My favorite Sushi Restaraunt in Los Angeles. You can always count on having great service and amazing and authentic sushi. Their spicy tuna and yellowtail cut rolls are a favorite. Hide's nigiri/sashimi is always fresh and delicious. If you're feeling adventurous try the Ankimo (monkfish liver) or the Amaebi (cooked tempura shrimp heads and raw shrimp served over rice). Not for everyone but if you like sushi and trying new things, this is the place to do it.  Cash only but they have an ATM inside. Don't mind the negative reviews, I've eaten at this sushi restaurant more times than I can count and am pretty picky when it comes to sushi. They've never disappointed. Some people decide they want to have a bad experience, so sure enough they'll have one.", "rating": "5 star rating"},
{"author": "Prada P.", "content": "Made some changes to their restaurant.  Renovated and looks much nicer and staff seem much more friendly", "rating": "5 star rating"},
{"author": "Henry J.", "content": "Food quantity is not good and too long waiting time. It doesn't worthy to visit:(:(:(", "rating": "1 star rating"},
{"author": "Nancy B.", "content": "Always superb! Freshest fish, best tempura, and every thing else. Employees are very efficient. Our go to sushi favorite!", "rating": "5 star rating"},
{"author": "Vië D.", "content": "In the meantime there were long lines everywhere, we decided to come in Hide because there's was no line here, we waited 7 mins to get set up. The service was mehh! Cash only, as they put the sign outdoor.FOODS : I am a picky eater, so mind me if you are the same. Everything has no flavor but salt, I have never tried any miso soup this bad. The food was not super salty, but it felt like they didn't put anything else but salt in their food. Even the side dish screams salt only lol. The salmon sashimi was not good. I wished I didn't order the salmon sashimi plate on top of my salmon sashimi combo. We ordered the beef teriyaki, it seems like the beef was not marinated, all they did was cooking it and put the teriyaki sauce on top, that's it, that's why inside of the beef, it was so bland. The only thing I would give 4 stars was the geoduck & scallops & mushroom dynamite. I had tried one that was much much better, so they don't earn 5 stars from me for this. I will not come back :)", "rating": "1 star rating"},
{"author": "Rebecca C.", "content": "I've passed by Hide Sushi many times and it always seems like there's a bit of a wait (just like every other place in Sawtelle!) to get a spot, but today it seemed like the wait was shorter than usual so we decided to give it a try. While we were waiting, we noticed that there's a sign on the door that notes that it's a cash-only establishment, but they do have an ATM inside. Tthe charge was maybe $1.60 to use it; my boyfriend got cash out and noted that it was cheaper than he expected. The person who was running the wait list was really friendly and the interior is super cute. I got the dinner combination with the beef teriyaki and the salmon sashimi, both of which were decent but nothing too impressive. It came with rice and sunomono with sesame seed. I think the cabbage-looking thing is tsukemono because it's listed on the website, but the menu on the website is slightly different than the PDF/QR code menu that opens up, which doesn't list this. I'm not sure if they were supposed to include the cabbage-looking thing to be honest because they also randomly brought me a miso soup which I didn't order--it wasn't a problem because I was thinking about ordering it, and a happy surprise. They did forget my rice for the dinner combination though (which they brought after I asked), so I think the service could use some improvement. I don't have any allergies or anything like that so it's not a problem if I'm brought someone else's order/an extra dish or something, but be careful if you do. My boyfriend got the spicy tuna, shrimp, salmon/avocado, yellowtail & scallion, and the scallops special roll. The shrimp was probably the least impressive of these and I think we would skip this the next time, but the last two were great. The cut roll pieces here seem like they have a little bit more height/are a little bigger than what I'm used to from other places, so even though they have just 4 pieces I thought it was a reasonable serving size. I think the best part though was the sushi (it's in the name after all!). Next time if I were to come, I would skip the dinner combinations in favor of the rolls.", "rating": "4 star rating"}
]